Repository: weblate/nextcloud-talk-bot
Catalog: locales/*.po
Languages: ar, fr, uk

source: Invalid input. Please enter 'yes' or 'no'.
ar: إدخالية غير صحيحة. من فضلك، أدخِل 'نعم yes'أو 'لا no'.
fr: Entrée invalide. Merci d'entrer 'yes' ou 'no'.
uk: Неправильний ввід. Будь ласка, введіть 'так' або 'ні'.

source: is a member of the
ar: عضوٌ في الـ
fr: est un membre de
uk: є членом

source: Aborted.
ar: تم إجهاض العملية.
fr: Annulé.
uk: Анульовано.

source: Are you sure you want to continue? (yes/no):
ar: هل أنت متأكد أنك ترغب في الاستمرار؟ (نعم/لا):
fr: Êtes-vous sûr de vouloir continuer ? (oui/non) :
uk: Ви впевнені, що бажаєте продовжити? (так/ні):

source: Arguments to pass to the function.
ar: البارامترات المُمرّرة إلى الدالة.
fr: Arguments à passer à la fonction.
uk: Аргументи для передачі функції.

source: Available options:
ar: الخيارات المتاحة:
fr: Options disponibles :
uk: Доступні опції:

source: Call Nextcloud Commands via NextcloudTalkBot Framework
ar: قُم باستدعاء أوامر نكست كلاود من خلال إطار العمل NextcloudTalkBot
fr: Lancer la commande Nextcloud via le framework NextcloudTalkBot
uk: Виклик команд Nextcloud через NextcloudTalkBot Framework

source: Continuing with FirstRunSetup...
ar: الاستمرار في الإعداد للتشغيل لأول مرة FirstRunSetup ...
fr: Poursuite avec FirstRunSetup...
uk: Продовження з FirstRunSetup...

source: Error: This script should not be run as root or with sudo.
ar: خطأ: لا ينبغي تشغيل هذا السكريبت كجذر أو باستخدام sudo.
fr: Erreur : Ce script ne devrait pas être lancé en tant que root ou avec sudo.
uk: Помилка: Даний скрипт не повинен бути запущений з root або з sudo.

source: First Run setup
ar: الإعداد للتشغيل لأول مرة
fr: Première mise en place
uk: Налаштування першого запуску

source: FirstRunSetup aborted.
ar: تمّ إجهاض عملية التشغيل لأول مرة.
fr: FirstRunSetup annulé.
uk: FirstRunSetup анульовано.

source: Found the following chats about the entered user. Select the chat by entering the number in front of it.
ar: تم العثور على الدردشات التالية حول المستخدم الذي تم إدخاله. قم باختيار الدردشة عن طريق إدخال الرقم الموجود أمامها.
fr: Les discussions de cet utilisateur ont été trouvées. Sélectionnez la discussion en entrant le nombre devant celle-ci.
uk: Знайдено наступні чати про введеного користувача. Виберіть чат, ввівши номер навпроти нього.

source: Function to call. Type option --list to get all parameters or option --help for help
ar: وظيفة للاتصال. اكتب option --list للحصول على كافة البارامترات أو option --help للحصول على المساعدة
fr: Fonction à appeler. Utilisez l'option --list pour lister tous les paramètres ou l'option --help pour afficher l'aide
uk: Функція для виклику. Введіть опцію --list для отримання всіх параметрів або опцію --help для отримання довідки

source: Incorrect login data. Please try again.
ar: بيانات الدخول غير صحيحة. حاول مرة أخرى من فضلك.
fr: Données de connexion incorrectes. Merci de réessayer.
uk: Неправильні дані входу. Будь ласка, спробуйте пізніше.

source: Invalid entry.
ar: إدخالية غير صحيحة.
fr: Entrée invalide.
uk: Неправильний вхід.

source: Invalid input. Please enter a number between 1 and
ar: إدخالية غير صحيحة. من فضلك، أدخِل رقماً بين 1 و
fr: Entrée invalide. Merci d'entrer un nombre entre 1 et
uk: Неправильний ввід. Будь ласка, введіть цифру поміж 1 та

source: Invalid selection.
ar: إختيار غير صحيح.
fr: Selection invalide.
uk: Неправильний вибір.

source: Login data are OK
ar: بيانات تسجيل الدخول مقبولة
fr: Les données de connexions sont OK
uk: Дані входу правильні

source: Message deleted
ar: تمّ حذف الرسالة
fr: Message supprimé
uk: Повідомлення видалено

source: Please choose event by number:
ar: من فضلك، حدِّد حدثاً من خلال رقمه:
fr: Veuillez choisir l'événement par numéro :
uk: Будь ласка, оберіть подію за номером:

source: Please enter a number.
ar: من فضلك، أدخِل رقماً.
fr: Veuillez entrer un nombre.
uk: Будь ласка, введіть номер.

source: Please enter the bot user's app password:
ar: الرجاء إدخال كلمة مرور مستخدم تطبيق الـ bot:
uk: Будь ласка, введіть пароль користувача додатку бота:

source: Please enter the number of the list item you want to select:
ar: الرجاء إدخال رقم عنصر القائمة الذي تريد اختياره:
fr: Veuillez entrer le numéro de l'élément que vous souhaitez sélectionner :
uk: Будь ласка, введіть номер елемента списку, який бажаєте обрати:

source: Please specify the username of the bot user:
ar: يرجى تحديد اسم مستخدم الـ bot:
fr: Veuillez spécifier le nom d'utilisateur du robot :
uk: Будь ласка, вкажіть ім'я користувача бота:

source: Poll closing aborted.
ar: تمّ إجهاض عملية غلق التصويت.
fr: Fermeture du vote annulée.
uk: Закриття опитування перервано.

source: PollId not found
ar: لم يُعثر على التصويتات
fr: PollId non trouvé
uk: Опитування не знайдено

source: Sending file to Nextcloud Talk
ar: إرسال ملف إلى تطبيق نكست كلاود للمحادثة Talk
fr: Envoi du fichier à Nextcloud Talk
uk: Надсилання файлу до Nextcloud Talk

source: Shared
ar: مُشتَرَك
fr: Partagé
uk: Поширено

source: Termin
ar: الموعد
uk: Термін

source: The user
ar: المستخدِم
fr: L'utilisateur
uk: Користувач.

source: Warning: Less than 10GB storage free.
ar: تحذير: المساحة المتاحة للتخزين أقل من 10 غيغا بايت.
fr: Attention : Moins de 10GB de stockage disponible.
uk: Попередження: Вільно менше 10 Гб сховища.

source: Warning: Less than 20% memory free.
ar: تحذير: المساحة المتاحة من الذاكرة أقل من 20%.
fr: Attention : Moins de 20% de mémoire disponible.
uk: Попередження: Вільно менше 20% пам'яті.

source: Warning: The system is swapping.
ar: تحذير: النظام يقوم الآن بعملية swapping لنقل البيانات ما بين الذاكرة الرئيسية و وحدات التخزين الثانوية.
fr: Attention : le système déplace de la mémoire dans le swap.
uk: Попередження: Система підміняється.

source: Warning: There are app updates available for the following apps:
ar: تحذير: تتوفر حاليّاً تحديثات للتطبيقات التالية:
fr: Attention : Des mises à jour sont disponibles pour les applications suivantes :
uk: Попередження: Доступні оновлення для наступних додатків:

source: changed
ar: تمّ التغيير
fr: changé
uk: змінено

source: created
ar: تمّ الإنشاء
fr: créé
uk: створено

source: deleted
ar: محذوفة
fr: supprimé
uk: видалено

source: event
ar: حدث
fr: événement
uk: подія

source: no
ar: لا
fr: non
uk: ні

source: to-do
ar: قائمة المهام
fr: à faire
uk: до виконання

source: yes
ar: نعم
fr: oui
uk: так

source: This wizard guides you through the configuration of the framework. Make sure you have created a bot user that has only limited rights. Enable 2FA for this bot user and create an app password in Nextcloud.
ar: يرشدك هذا المُساعِد wizard خلال عملية تكوين إطار العمل. تأكد من أنك قمت بإنشاء مستخدم لـbot يتمتع بحقوق محدودة فقط. قم بتمكين المصادقة الثنائية له، وقم بإنشاء كلمة مرور التطبيق في نكست كلاود.
fr: Cet assistant vous guide dans la configuration du framework. Assurez-vous que vous avez créé un utilisateur bot qui n'a que des droits limités. Activez 2FA pour cet utilisateur bot et créez un mot de passe app dans Nextcloud.
uk: Цей майстер допоможе вам налаштувати фреймворк. Переконайтеся, що ви створили користувача-бота з обмеженими правами. Увімкніть 2FA для цього користувача бота і створіть пароль додатку в Nextcloud.

source: The .nextclouddata file does not exist. Please run the first_run_setup script first.
ar: الملف ‎.nextclouddata غير موجود. الرجاء تشغيل البرنامج النصي first_run_setup أولاً.
fr: Le fichier .nextclouddata n'existe pas. Veuillez d'abord lancer le script first_run_setup.
uk: Файл .nextclouddata не існує. Будь ласка, запустіть спершу скрипт first_run_setup.

source: Warning: CPU load is greater than 10.
ar: تحذير: حَمْل وحدة المُعالجة المركزية CPU أكثر من 10.
fr: Attention : la charge du processeur est supérieure à 10.
uk: Попередження: значення завантаження CPU більше, ніж 10.

source: type options --list to get available functions
ar: أكتُب خيارات -- للحصول على الوظائف المتاحة
fr: entrez l'option --list pour lister les fonctions disponibles
uk: введіть опції --list, щоб отримати список доступних функцій

source: Aufgabe
ar: مهمة
uk: Завдання

source: List available options or functions.
ar: قائمة بالخيارات أو الوظائف المتاحة.
fr: Lister les options ou fonctions disponibles.
uk: Список доступних опцій або функцій.

source: Option name. Type --list to get all options.
ar: اسم الخيار. إكتُب -- لعرض قائمة بكل الخيارات المتوفرة.
fr: Nom de l'option. Tappez --list pour lister toutes les options.
uk: Назва опції. Введіть --list для отримання всіх опцій.

source: Please enter your complete Nextcloud address including https://:
ar: الرجاء إدخال عنوان نكست كلاود الكامل الخاص بك بما في ذلك https://:
fr: Veullez entrer l'adresse complète de Nextcloud en incluant https:// :
uk: Будь ласка, введіть вашу повну адресу Nextcloud, включаючи https://:

source: The .nextclouddata file already exists. If you continue, this file will be overwritten.
ar: الملف ‎.nextclouddata موجود بالفعل. إذا قمت بالمتابعة، سيتم الكتابة فوق هذا الملف.
fr: Le fichier .nextclouddata existe déjà. Si vous continuez, il sera écrasé.
uk: Файл .nextclouddata вже існує. Якщо ви продовжите, даний файл буде переписано.
